package printers

/**
 * Printer
 *
 * Інтерфейс, який представляє набір функцій для організації завдань у послідовність операцій
 */
interface Printer {
    /**
     * Conditions
     *
     * Виводить інформацію про умову завдання
     */
    fun conditions():Printer

    /**
     * Prompt
     *
     * Запрошує користувача ввести дані для виконання завдання
     */
    fun prompt():Printer

    /**
     * Input
     *
     * Ввід та обробка даних від користувача
     */
    fun input():Printer

    /**
     * Result
     *
     * Оформляє та виводить результат виконаного завдання
     */
    fun result()
}